Repository: pingfangx/TranslatorX-other
Catalog: miscellaneous/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Note one exception to the ordering: the Certificate message is used twice in the handshake (from server to client, then from client to server), but described only in its first position.
zh_cn: 请注意排序的一个例外：Certificate 消息在握手中使用两次(从服务器到客户端，然后从客户端到服务器)，但仅在其第一个位置进行描述。

source: Note that Application Data records MUST NOT be written to the wire unprotected (see Section 2 for details).
zh_cn: 请注意，应用程序数据记录不得写入未受保护的线路(有关详细信息，请参阅第 2 节)。

source: Note that TLS 1.2 defines this extension differently.
zh_cn: 请注意，TLS 1.2 以不同方式定义此扩展。

source: Note that TLS 1.3 servers might receive TLS 1.2 or prior ClientHellos which contain other compression methods and (if negotiating such a prior version) MUST follow the procedures for the appropriate prior version of TLS.
zh_cn: 请注意，TLS 1.3 服务器可能会收到包含其他压缩方法的 TLS 1.2 或之前的 ClientHellos，并且(如果协商此类先前版本)必须遵循相应的 TLS 先前版本的过程。

source: Note that a PublishSubject may begin emitting items immediately upon creation (unless you have taken steps to prevent this), and so there is a risk that one or more items may be lost between the time the Subject is created and the observer subscribes to it.
zh_cn: 请注意，PublishSubject 可能会在创建后立即开始发射项目(除非您已采取措施防止此情况)，因此在创建 Subject 和观察者订阅它之间的时间段内，可能会丢失一个或多个项目。

source: Note that a TCP receiving a FIN will ACK but not send its own FIN until its user has CLOSED the connection also.
zh_cn: 请注意，接收 FIN 的 TCP 将确认但不发送自己的 FIN，直到其用户也已 CLOSED 连接。

source: Note that a certificate containing a key for one signature algorithm MAY be signed using a different signature algorithm (for instance, an RSA key signed with an ECDSA key).
zh_cn: 请注意，可以使用不同的签名算法(例如，使用 ECDSA 密钥签名的 RSA 密钥)对包含一个签名算法的密钥的证书进行签名。

source: Note that a client MAY send no certificates if it does not have an appropriate certificate to send in response to the server's authentication request.
zh_cn: 请注意，如果客户端没有要响应服务器的身份验证请求而发送的相应证书，则可以不发送证书。

source: Note that a premature close does not call into question the security of the data already received, but simply indicates that subsequent data might have been truncated.
zh_cn: 请注意，过早关闭不会对已收到的数据的安全性产生疑问，而只是表明后续数据可能已被截断。

source: Note that a server might reject traffic that it deems abusive or characteristic of a denial-of-service attack, such as an excessive number of open connections from a single client.
zh_cn: 请注意，服务器可能会拒绝其认为具有滥用或拒绝服务攻击特征的流量，例如来自单个客户端的过多打开连接。

source: Note that a signature algorithm takes as input an arbitrary-length message, rather than a digest.
zh_cn: 请注意，签名算法将任意长度的消息作为输入，而不是摘要。

source: Note that an implementation which does this MAY choose to reuse the session.
zh_cn: 请注意，执行此操作的实现可以选择重用会话。

source: Note that as of TLS 1.1, failure to properly close a connection no longer requires that a session not be resumed.
zh_cn: 请注意，从 TLS 1.1 开始，无法正确关闭连接不再需要恢复会话。

source: Note that automatic retransmission of early data could result in incorrect assumptions regarding the status of the connection.
zh_cn: 请注意，早期数据的自动重传可能导致关于连接状态的错误假设。

source: Note that because the handshake transcript includes the random values from the Hello messages, any given handshake will have different traffic secrets, even if the same input secrets are used, as is the case when the same PSK is used for multiple connections.
zh_cn: 请注意，由于握手 transcript 包含来自 Hello 消息的随机值，因此即使使用相同的输入密钥，任何给定的握手也将具有不同的传输秘钥，就像将相同的 PSK 用于多个连接的情况一样。

source: Note that certificate-based client authentication is not available in PSK handshake flows (including 0-RTT).
zh_cn: 请注意，基于证书的客户端身份验证在 PSK 握手流程(包括 0-RTT)中不可用。

source: Note that due to how request management works, calling `request(n)` from `Subscriber.onSubscribe` or `ResourceSubscriber.onStart` may trigger calls to `onNext` immediately before the `request()` call itself returns to the `onSubscribe`/`onStart` method of yours:
zh_cn: 请注意，由于请求管理的工作方式，从 `Subscriber.onSubscribe` 或 `ResourceSubscriber.onStart` 调用 `request(n)` 可能会立即触发对 `onNext` 的调用，该调用在 `request()` 调用本身返回 `onSubscribe`/`onStart` 方法之前：

source: Note that earlier versions of TLS used a different RSA signature scheme that did not include a DigestInfo encoding.
zh_cn: 请注意，早期版本的 TLS 使用不同的 RSA 签名方案，该方案不包含 DigestInfo 编码。

source: Note that explicitly constructing the pre_master_secret with the ClientHello.client_version produces an invalid master_secret if the client has sent the wrong version in the original pre_master_secret.
zh_cn: 请注意，如果客户端在原始 pre_master_secret 中发送了错误的版本，则使用 ClientHello.client_version 显式构造 pre_master_secret 会生成无效的 master_secret。

source: Note that higher layers should not be overly reliant on whether TLS always negotiates the strongest possible connection between two peers.
zh_cn: 请注意，较高层不应过分依赖于 TLS 是否始终协商两个对等端之间最强的连接。

source: Note that if a TCP is reinitialized in some sense, yet retains its memory of sequence numbers in use, then it need not wait at all; it must only be sure to use sequence numbers larger than those recently used.
zh_cn: 请注意，如果 TCP 在某种意义上重新初始化，但仍然保留其使用的序列号的内存，那么它根本不需要等待；它必须只能确保使用大于最近使用的序列号。

source: Note that if raw public keys [RFC7250] or the cached information extension [RFC7924] are in use, then this message will not contain a certificate but rather some other value corresponding to the server's long-term key.
zh_cn: 请注意，如果正在使用原始公钥 [RFC7250] 或缓存的信息扩展 [RFC7924]，则此消息将不包含证书，而是包含与服务器的长期密钥对应的其他值。

source: Note that if the PSK can be used without (EC)DHE, then non-overlap in the "supported_groups" parameters need not be fatal, as it is in the non-PSK case discussed in the previous paragraph.
zh_cn: 请注意，如果 PSK 可以在没有 (EC)DHE 的情况下使用，那么“supported_groups”参数中的非重叠不一定是致命的，因为它是在前一段中讨论的非 PSK 情况中。

source: Note that if the check fails, the PreMasterSecret SHOULD be randomized as described below.
zh_cn: 请注意，如果检查失败，PreMasterSecret 应该按照下面的描述随机化。

source: Note that implementations can use (EC)DHE and PSK together, in which case both extensions will be supplied.
zh_cn: 注意，实现可以一起使用(EC)DHE 和 PSK，在这种情况下将提供两个扩展。

source: Note that in many cases the URI itself comes from an untrusted source.
zh_cn: 请注意，在许多情况下，URI 本身来自不受信任的来源。

source: Note that in some cases (e.g., DH parameters) it is necessary to represent integers as opaque vectors.
zh_cn: 注意，在某些情况下(例如，DH 参数)，必须将整数表示为不透明 vector。

source: Note that in some cases a zero-length Context (indicated by "") is passed to HKDF-Expand-Label.
zh_cn: 请注意，在某些情况下，零长度上下文(由 "" 表示)传递给 HKDF-Expand-Label。

source: Note that in versions of TLS prior to 1.1, there was no IV field, and the last ciphertext block of the previous record (the "CBC residue") was used as the IV.
zh_cn: 注意，在 1.1 之前的 TLS 版本中，没有 IV 字段，并且前一记录的最后一个密文块(“CBC 残留”)被用作 IV。

source: Note that it currently doesn't support additional parameters to those backpressure modes.
zh_cn: 请注意，它目前不支持那些背压模式的附加参数。

source: Note that one tick mark represents one bit position.
zh_cn: 请注意，一个刻度标记表示一位位置。

source: Note that only extensions offered by the client can appear in the server's list.
zh_cn: 请注意，只有客户端提供的扩展才能出现在服务器列表中。

source: Note that other forms of dotted notation may be interpreted on some platforms, as described in Section 7.4, but only the dotted-decimal form of four octets is allowed by this grammar.
zh_cn: 请注意，其他形式的点分表示法可能会在某些平台上解释，如第 7.4 节所述，但此语法只允许四个八位字节的点分十进制形式。

source: Note that other groups may also distribute working documents as Internet-Drafts.
zh_cn: 请注意，其他组也可能将工作文档分发为 Internet-Drafts。

source: Note that renegotiation is not possible when TLS 1.3 has been negotiated.
zh_cn: 请注意，在协商 TLS 1.3 时无法进行重新协商。

source: Note that some older HTTP applications do not recognize media type parameters.
zh_cn: 请注意，某些较旧的 HTTP 应用程序无法识别媒体类型参数。

source: Note that the "https" URI scheme depends on both TLS and TCP for establishing authority.
zh_cn: 请注意，“https”URI 方案依赖于 TLS 和 TCP 来建立权限。

source: Note that the MAC is computed before encryption.
zh_cn: 请注意，MAC 是在加密之前计算的。

source: Note that the absolute path cannot be empty; if none is present in the original URI, it MUST be given as "/" (the server root).
zh_cn: 注意绝对路径不能为空；如果原始 URI 中不存在，则必须以“/”(服务器根)的形式给出。

source: Note that the different calls to Derive-Secret may take different Messages arguments, even with the same secret.
zh_cn: 请注意，对 Derive-Secret 的不同调用可能会使用不同的 Messages 参数，即使具有相同的密钥。

source: Note that the handshake protocol, including the ClientHello and ServerHello messages, authenticates the protocol version, so this value is redundant.
zh_cn: 请注意，握手协议(包括 ClientHello 和 ServerHello 消息)会对协议版本进行身份验证，因此该值是多余的。

source: Note that the introduction of the algorithm field is a change from previous versions.
zh_cn: 请注意，算法字段的引入是对先前版本的更改。

source: Note that the last two strategies cause discontinuity in the stream as they drop out elements.
zh_cn: 请注意，最后两个策略会导致流不连续，因为它们会删除元素。

source: Note that the list of options may be shorter than the data offset field might imply.
zh_cn: 请注意，选项列表可能比数据偏移字段可能暗示的要短。

source: Note that the major and minor numbers MUST be treated as separate integers and that each MAY be incremented higher than a single digit.
zh_cn: 请注意，主要和次要数字必须被视为单独的整数，并且每个数字可以增加到高于一位数字。

source: Note that the presence of a URI with a given authority component does not imply that there is always an HTTP server listening for connections on that host and port.
zh_cn: 请注意，具有给定权限组件的 URI 的存在并不意味着始终有 HTTP 服务器侦听该主机和端口上的连接。

source: Note that the proxy MAY forward the request on to another proxy or directly to the server specified by the absoluteURI.
zh_cn: 请注意，代理可以将请求转发到另一个代理或直接转发到 absoluteURI 指定的服务器。

source: Note that the sequence number of the segment in line 5 is the same as in line 4 because the ACK does not occupy sequence number space (if it did, we would wind up ACKing ACK's!).
zh_cn: 请注意，第 5 行中的报文段的序列号与第 4 行中的相同，因为 ACK 不占用序列号空间(如果确实如此，我们将结束 ACK 确认！)。

source: Note that there are certificates that use algorithms and/or algorithm combinations that cannot be currently used with TLS.
zh_cn: 请注意，有些证书使用的算法和/或算法组合目前无法与 TLS 一起使用。

source: Note that there is a possibility for inconsistencies here.
zh_cn: 请注意，此处存在不一致的可能性。

source: Note that there is no requirement that the server resume any session even if it had formerly provided a session_id.
zh_cn: 请注意，即使服务器之前提供了 session_id，也不要求服务器恢复任何会话。

source: Note that these correspond to the "PureEdDSA" algorithms and not the "prehash" variants.
zh_cn: 请注意，这些算法对应于“PureEdDSA”算法，而不是“prehash”变体。

source: Note that these rules are stricter than what was enforced in TLS 1.2.
zh_cn: 请注意，这些规则比 TLS 1.2 中强制执行的规则更严格。

source: Note that this also implies that the DH_DSS, DH_RSA, ECDH_ECDSA, and ECDH_RSA key exchange algorithms do not restrict the algorithm used to sign the certificate.
zh_cn: 请注意，这也意味着 DH_DSS，DH_RSA，ECDH_ECDSA 和 ECDH_RSA 密钥交换算法不会限制用于签署证书的算法。

source: Note that this also relaxes some of the constraints on signature and hash algorithms from previous versions of TLS.
zh_cn: 请注意，这也放宽了以前版本的 TLS 对签名和哈希算法的一些限制。

source: Note that this does not mean skipping rounds, so if PSK is not in use, Early Secret will still be HKDF-Extract(0, 0).
zh_cn: 请注意，这并不意味着跳过轮次，因此如果不使用 PSK，早期秘密仍将是 HKDF-Extract(0,0)。

source: Note that this field is echoed even if the client's value corresponded to a cached pre-TLS 1.3 session which the server has chosen not to resume.
zh_cn: 请注意，即使客户端的值对应于服务器已选择不恢复的缓存的 TLS 1.3 之前的会话，也会回显此字段。

source: Note that this implies that a certificate containing a key for one signature algorithm MAY be signed using a different signature algorithm (for instance, an RSA key signed with a DSA key).
zh_cn: 请注意，这意味着可以使用不同的签名算法(例如，使用 DSA 密钥签名的 RSA 密钥)对包含一个签名算法的密钥的证书进行签名。

source: Note that this is a new piece of syntax in TLS 1.2.
zh_cn: 请注意，这是 TLS 1.2 中的一种新语法。

source: Note that this list is not exhaustive -- it does not include extension status codes defined in other specifications.
zh_cn: 请注意，此列表并非详尽无遗 - 它不包括其他规范中定义的扩展状态代码。

source: Note that this mechanism makes it possible to negotiate a version prior to TLS 1.2 if one side supports a sparse range.
zh_cn: 请注意，如果一方支持稀疏范围，则此机制可以协商 TLS 1.2 之前的版本。

source: Note that this method of detecting optional data differs from the normal TLS method of having a variable-length field, but it is used for compatibility with TLS before extensions were defined.
zh_cn: 请注意，这种检测可选数据的方法与具有可变长度字段的常规 TLS 方法不同，但它用于与定义扩展之前的 TLS 兼容。

source: Note that this record may appear at a point at the handshake where the implementation is expecting protected records, and so it is necessary to detect this condition prior to attempting to deprotect the record.
zh_cn: 请注意，此记录可能出现在执行期望受保护记录的握手处，因此有必要在尝试对记录进行去保护之前检测此情况。

source: Note that this relaxes the constraints on certificate-signing algorithms found in prior versions of TLS.
zh_cn: 请注意，这放宽了对先前版本的 TLS 中的证书签名算法的限制。

source: Note that this representation has the same encoding as with previous versions.
zh_cn: 请注意，此表示具有与以前版本相同的编码。

source: Note that this requires both sides to either buffer the messages or compute running hashes for all potential hash algorithms up to the time of the CertificateVerify computation.
zh_cn: 请注意，这要求双方要么缓冲消息，要么计算所有潜在哈希算法的运行哈希，直到 CertificateVerify 计算时为止。

source: Note that unconditional conversion in the other direction is not required, in that not all characters may be available in a given character set and a character set may provide more than one sequence of octets to represent a particular character.
zh_cn: 注意，不需要在另一个方向上的无条件转换，因为并非所有字符都可以在给定字符集中可用，并且字符集可以提供多于一个八位字节序列来表示特定字符​​。

source: Note that when the receive window is zero no segments should be acceptable except ACK segments.
zh_cn: 请注意，当接收窗口为零时，除了 ACK 报文段之外，不应接受任何报文段。

source: Note that while the server may send Application Data prior to receiving the client's Authentication messages, any data sent at that point is, of course, being sent to an unauthenticated peer.
zh_cn: 请注意，虽然服务器可能会在接收客户端的身份验证消息之前发送应用程序数据，但此时发送的任何数据当然都会发送给未经身份验证的对等端。

source: Note that, as with the server certificate, there are certificates that use algorithms/algorithm combinations that cannot be currently used with TLS.
zh_cn: 请注意，与服务器证书一样，有些证书使用目前无法与 TLS 一起使用的算法/算法组合。

source: Note that, for historical reasons, the data element is named using GMT, the predecessor of the current worldwide time base, UTC.
zh_cn: 请注意，由于历史原因，数据元素使用 GMT 命名，GMT 是当前全球时基 UTC 的前身。

source: Note the use of the `LATEST` backpressure mode; if we know there will be only a single value, we don't need the `BUFFER` strategy as it allocates a default 128 element long buffer (that grows as necessary) that is never going to be fully utilized.
zh_cn: 注意使用 `LATEST` 背压模式；如果我们知道只有一个值，我们不需要 `BUFFER` 策略，因为它分配一个永远不会被充分利用的默认 128 元素长缓冲区(必要时增长)。

source: Note, however, that `flatMap` doesn't guarantee any order and the end result from the inner flows may end up interleaved.
zh_cn: 但请注意，`flatMap` 不保证任何顺序，内部流的最终结果可能会交错出现。

source: Note, however, that some received protocol elements might not be parsed.
zh_cn: 但请注意，某些收到的协议元素可能无法解析。

source: Note, however, that subsequent post-handshake authentications do not include each other, just the messages through the end of the main handshake.
zh_cn: 但是请注意，后续的握手后身份验证不会互相包含，只是通过主握手结束的消息。

source: Note: When using an out-of-band provisioned pre-shared secret, a critical consideration is using sufficient entropy during the key generation, as discussed in [RFC4086].
zh_cn: 注意：当使用带外预配置的预共享密钥时，关键考虑因素是在密钥生成期间使用足够的熵，如 [RFC4086] 中所述。

source: Note: A CompressionMethod.null operation is an identity operation;
zh_cn: 注意：CompressionMethod.null 操作是一种恒等操作；

source: Note: Alerts and any other non-handshake record types are not handshake messages and are not included in the hash computations.
zh_cn: 注意：警报和任何其他非握手记录类型不是握手消息，并且不包括在哈希计算中。

source: Note: Attacks discovered by Bleichenbacher [BLEI] and Klima et al.
zh_cn: 注意：Bleichenbacher [BLEI] 和 Klima 等人发现的攻击。

source: Note: Because not all signature algorithms and hash algorithms may be accepted by an implementation (e.g., DSA with SHA-1, but not SHA-256), algorithms here are listed in pairs.
zh_cn: 注意：因为并非所有签名算法和散列算法都可以被实现接受(例如，具有 SHA-1 但不是 SHA-256 的 DSA)，所以这里的算法成对列出。

source: Note: ChangeCipherSpec messages, alerts, and any other record types are not handshake messages and are not included in the hash computations.
zh_cn: 注意：ChangeCipherSpec 消息、警报和任何其他记录类型都不是握手消息，也不包含在哈希计算中。

source: Note: Converting between versions of HTTP may involve modification of header fields required or forbidden by the versions involved.
zh_cn: 注意：在 HTTP 版本之间进行转换可能涉及修改所涉及版本所需或禁止的首部字段。

source: Note: Data of different TLS record layer content types MAY be interleaved.
zh_cn: 注意：不同 TLS 记录层内容类型的数据可以交错。

source: Note: Diffie-Hellman parameters are specified by the server and may be either ephemeral or contained within the server's certificate.
zh_cn: 注意：Diffie-Hellman 参数由服务器指定，可以是临时的（ephemeral），也可以包含在服务器的证书中。

source: Note: For a given Diffie-Hellman group, the padding results in all public keys having the same length.
zh_cn: 注意：对于给定的 Diffie-Hellman 组，填充会导致所有公钥具有相同的长度。

source: Note: HTTP requirements for the date/time stamp format apply only to their usage within the protocol stream.
zh_cn: 注意：日期/时间戳格式的 HTTP 要求仅适用于它们在协议流中的使用。

source: Note: HTTP's use of Content-Length for message framing differs significantly from the same field's use in MIME, where it is an optional field used only within the "message/external-body" media-type.
zh_cn: 注意：HTTP 对消息框架的 Content-Length 的使用与 MIME 中相同字段的使用显着不同，在 MIME 中，它是仅在“message/external-body”媒体类型中使用的可选字段。

source: Note: If a rehandshake occurs while data is flowing on a connection, the communicating parties may continue to send data using the old CipherSpec.
zh_cn: 注意：如果数据在连接上流动时发生重新握手，则通信方可以继续使用旧的 CipherSpec 发送数据。

source: Note: In current terminology, DSA refers to the Digital Signature Algorithm and DSS refers to the NIST standard.
zh_cn: 注意：在当前术语中，DSA 指的是数字签名算法 (Digital Signature Algorithm)，DSS 指的是 NIST 标准。

source: Note: In practice, the "Set-Cookie" header field ([RFC6265]) often appears multiple times in a response message and does not use the list syntax, violating the above requirements on multiple header fields with the same name.
zh_cn: 注意：实际上，“Set-Cookie”首部字段([RFC6265])经常在响应消息中多次出现，并且不使用列表语法，违反了对具有相同名称的多个首部字段的上述要求。

source: Note: In versions of TLS prior to TLS 1.3, this extension was named "elliptic_curves" and only contained elliptic curve groups.
zh_cn: 注意：在 TLS 1.3 之前的 TLS 版本中，此扩展为“elliptic_curves”，仅包含椭圆曲线组。

source: Note: It is a fatal handshake_failure alert for an anonymous server to request client authentication.
zh_cn: 注意：匿名服务器请求客户端身份验证会导致致命的 handshake_failure 警报。

source: Note: It is assumed that closing a connection reliably delivers pending data before destroying the transport.
zh_cn: 注意：假设关闭连接在销毁传输之前可靠地传递挂起的数据。

source: Note: PKCS #7 [PKCS7] is not used as the format for the certificate vector because PKCS #6 [PKCS6] extended certificates are not used.
zh_cn: 注意：PKCS #7 [PKCS7] 不用作证书 vector 的格式，因为不使用 PKCS #6 [PKCS6] 扩展证书。

source: Note: Prior to TLS 1.3, "certificate_list" ordering required each certificate to certify the one immediately preceding it; however, some implementations allowed some flexibility.
zh_cn: 注意：在 TLS 1.3 之前，“certificate_list”顺序要求每个证书对其前面的证书进行认证；但是，一些实现允许一些灵活性。

source: Note: Recipients of date values are encouraged to be robust in accepting date values that may have been sent by non-HTTP applications, as is sometimes the case when retrieving or posting messages via proxies/gateways to SMTP or NNTP.
zh_cn: 注意：鼓励日期值的接收者在接受非 HTTP 应用程序可能发送的日期值时非常健壮，有时在通过代理/网关检索或发布消息到 SMTP 或 NNTP 时也是如此。

source: Note: Servers ought to be cautious about depending on URI lengths above 255 bytes, because some older client or proxy implementations might not properly support these lengths.
zh_cn: 注意：服务器应该谨慎依赖于长度超过 255 个字节的 URI，因为某些较旧的客户端或代理实现可能无法正确支持这些长度。

source: Note: The "multipart/form-data" type has been specifically defined for carrying form data suitable for processing via the POST request method, as described in RFC 1867 [15].
zh_cn: 注意：“multipart/form-data”类型已经专门定义用于携带适合通过 POST 请求方法处理的表单数据，如 RFC 1867 [15] 中所述。

source: Note: The "no rewrite" rule prevents the proxy from changing the meaning of the request when the origin server is improperly using a non-reserved URI character for a reserved purpose.
zh_cn: 注意：“无重写”规则可防止代理在原始服务器不正确地使用非保留 URI 字符用于保留目的时更改请求的含义。

source: Note: The handshake transcript incorporates the initial ClientHello/HelloRetryRequest exchange; it is not reset with the new ClientHello.
zh_cn: 注意：握手记录包含初始的 ClientHello/HelloRetryRequest 交换；它不会被新的 ClientHello 重置。

source: Note: The status_request_v2 extension [RFC6961] is deprecated.
zh_cn: 注意：不推荐使用 status_request_v2 扩展 [RFC6961]。

source: Note: The version number in the PreMasterSecret is the version offered by the client in the ClientHello.client_version, not the version negotiated for the connection.
zh_cn: 注意：PreMasterSecret 中的版本号是客户端在 ClientHello.client_version 中提供的版本，而不是为连接协商的版本。

source: Note: This enum is named "SignatureScheme" because there is already a "SignatureAlgorithm" type in TLS 1.2, which this replaces.
zh_cn: 注意：此枚举名为“SignatureScheme”，因为在 TLS 1.2 中已经有一个“SignatureAlgorithm”类型，这将替换它。

source: Note: This is a change from [RFC5246], so in practice many TLS 1.2 clients and servers will not behave as specified above.
zh_cn: 注意：这是对 [RFC5246] 的更改，因此在实践中，许多 TLS 1.2 客户端和服务器的行为不会如上所述。

source: Note: This use of the term "character set" is more commonly referred to as a "character encoding." However, since HTTP and MIME share the same registry, it is important that the terminology also be shared.
zh_cn: 注意：术语“字符集”的这种使用通常被称为“字符编码”。但是，由于 HTTP 和 MIME 共享相同的注册表，因此共享术语也很重要。

source: Note: To help avoid pipeline stalls, ChangeCipherSpec is an independent TLS protocol content type, and is not actually a TLS handshake message.
zh_cn: 注意：为了帮助避免管道停顿，ChangeCipherSpec 是一种独立的 TLS 协议内容类型，实际上并不是 TLS 握手消息。

source: Note: Values listed as RESERVED may not be used.
zh_cn: 注意：不能使用列为 RESERVED 的值。

source: Note: Versions of TLS prior to 1.3 permitted point format negotiation; TLS 1.3 removes this feature in favor of a single point format for each curve.
zh_cn: 注意：1.3 之前的 TLS 版本允许点格式协商；TLS 1.3 删除了此功能，支持每条曲线的单点格式。

source: Note: With block ciphers in CBC mode (Cipher Block Chaining), it is critical that the entire plaintext of the record be known before any ciphertext is transmitted.
zh_cn: 注意：对于 CBC 模式下的分组加密(加密块链接)，在传输任何密文之前，必须知道记录的整个明文。

source: Note: With common hash functions, any label longer than 12 characters requires an additional iteration of the hash function to compute.
zh_cn: 注意：对于常见的哈希函数，任何超过 12 个字符的标签都需要额外迭代哈希函数来进行计算。

source: Note: this extension is not meaningful for TLS versions prior to 1.2.
zh_cn: 注意：此扩展对 1.2 之前的 TLS 版本没有意义。

source: Note: this is a change from TLS 1.1 where there are no explicit rules, but as a practical matter one can assume that the peer supports MD5 and SHA-1.
zh_cn: 注意：这是对 TLS 1.1 的更改，其中没有明确的规则，但实际上可以假设对等端支持 MD5 和 SHA-1。

source: Now suppose, at this instant, the host crashes, recovers, and establishes a new incarnation of the connection.
zh_cn: 现在假设，在这一瞬间，主机崩溃，恢复并建立连接的新化身。

source: Now you can directly block for some results by invoking a `blockingX` operation directly:
zh_cn: 现在，您可以通过直接调用 `blockingX` 操作直接阻塞某些结果：

source: Null or Standard Stream Cipher
zh_cn: 空或标准流加密

source: Numbering of octets within a segment is that the first data octet immediately following the header is the lowest numbered, and the following octets are numbered consecutively.
zh_cn: 报文段内八位字节的编号是紧跟在首部之后的第一个数据八位字节，其编号最小的，并且后面的八位字节是连续编号的。

source: OCSP Status and SCT Extensions
zh_cn: OCSP 状态和 SCT 扩展

source: OCTET = <any 8-bit sequence of data>
zh_cn: OCTET = <任何 8 位数据序列>

source: Objects of the Worker class implement the Subscription interface, with its isUnsubscribed and unsubscribe methods, so you can stop work when a subscription is cancelled, or you can cancel the subscription from within the scheduled task:
zh_cn: Worker 类的对象实现 Subscription 接口，使用他的 isUnsubscribed 和 unsubscribe 方法，因此你可以在取消订阅时停止工作，也可以从计划任务中取消订阅：

source: Observable Utility Operators
zh_cn: Observable 辅助操作符

source: Observables Are Composable
zh_cn: Observables 是可组合的
